Team-Managed/melodypay/esp32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_FREERTOS_UNICORE=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y

# Development-only key backend. Production builds must disable this and use a
# secp256k1-capable secure element implementation.
CONFIG_MELODY_DEV_KEY_BACKEND=y
CONFIG_MELODY_SECURE_ELEMENT_BACKEND=n
CONFIG_MELODY_ENABLE_MAINNET=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED=y
CONFIG_MBEDTLS_ECDSA_DETERMINISTIC=y
